Revit 2024 API
RectangleLightShape Constructor
 Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RectangleLightShape()
Visual Basic
Public Sub New
Visual C++
public:
RectangleLightShape()
See Also
RectangleLightShape Class
RectangleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace